app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
    def index
        beers = Beer.all

INSERT INTO "beers" ("beer_name", "brewery_name", "style", "abv", "ibu", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        beer = Beer.create(strong_params)

SELECT "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "beers" SET "brewery_name" = $1, "updated_at" = $2 WHERE "beers"."id" = $3  [["brewery_name", "Criner"], ["updated_at", "2023-04-25 20:15:28.849325"], ["id", 18]]
---
    def update
        beer = Beer.find(params[:id])
        beer.update(strong_params)

SELECT "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "beers" WHERE "beers"."id" = $1  [["id", 14]]
---
    def destroy
        beer = Beer.find(params[:id])
        beer.destroy